package loader;

import tools.NativeJS;
import loader.Global;

/**
 * Балансировщик нагрузки. 🚦  
 * Используется для ограничения количества отправляемых запросов
 * в единицу времени. Запросы встают в очередь и отправляются позже,
 * если их количество начинает превышать заданные лимиты. Один
 * балансировщик соответствует одному узлу.
 * 
 * Способ применения:
 * 1. Создать экземпляр `Balancer`, настроить необходимый лимит запросов.
 * 2. Назначить созданный экземпляр `Balancer` каждому загрузчику `ILoader`
 *    **до** вызова метода `load()`.
 */
@:dce 
class Balancer
{
    /**
     * Интервал обновлений для запуска запросов. (mc)
     */
    static private inline var INTERVAL_UPDATE:Int = 100;

    // Приват
    private var loaders:Array<ILoader> = new Array();
    private var interval:Dynamic = null;
    private var time:Float = 0;

    /**
     * Создать балансировщик.
     * @param rps Ограничение частоты запросов. (Request per second)
     */
    public function new(rps:Float = 1) {
        this.rps = rps;
    }

    /**
     * Ограничение частоты запросов. (Request per second)
     * - Это значение не может быть меньше `0`.
     * - Если задано `0` - запросы никогда не будут отправлены.
     * 
     * По умолчанию: `1` (Один запрос в секунду)
     */
    public var rps(default, set):Float;
    function set_rps(value:Float):Float {
        if (value > 0) {
            if (value == rps)
                return value;

            rps = value;

            if (interval == null && length > 0)
                interval = Global.setInterval(onUpdate, INTERVAL_UPDATE, this);
        }
        else {
            if (rps == 0)
                return value;

            rps = 0;

            if (interval != null) {
                Global.clearInterval(interval);
                interval = null;
            }
        }

        return value;
    }

    /**
     * Количество запросов в очереди. (Штук)  
     * По умолчанию: `0`
     */
    public var length(default, null):Int = 0;

    /**
     * Обновление.  
     * Метод сделан статическим, что бы хакс не использовал `bind()`,
     * который нужен для привязки контенкста `this`. Так будет работать
     * быстрее.
     * @param b Обновляемый балансировщик.
     */
    static private function onUpdate(b:Balancer):Void {

        // Обновление
        // Выключаем обновление, если загрузчиков больше нет:
        if (b.length == 0) {
            if (b.interval != null) {
                Global.clearInterval(b.interval);
                b.interval = null;
            }
            return;
        }

        // Метод гарантированно не вызовется, если rps <= 0:
        var t = 1000 / b.rps;         // Время на 1 запрос. (mc)
        var ct = NativeJS.now();      // Текущее время. (mc)
        var dt = ct - b.time;         // Реально прошедшее время с момента последнего запроса. (mc)

        // Времени прошло слишком мало даже для выполнения 1 запроса:
        if (dt < t)
            return;

        // Максимально прошедшее время для 1 тика: (Чтоб не было скачка запросов)
        var mt = Math.max(t + INTERVAL_UPDATE, INTERVAL_UPDATE * 2);
        var num = 0; // <-- Количество отправляемых запросов
        if (dt > mt) {
            // Скачок прошедшего времени:
            num = Math.floor(mt / t);
            if (num > b.length)
                num = b.length;
            
            b.time = ct; // <-- Приближённое уравнение с пропуском промежутка в скачке
        }
        else {
            // Нет скачка прошедшего времени:
            num = Math.floor(dt / t);
            if (num > b.length)
                num = b.length;
            
            b.time += num * t; // <-- Точное уравнение, ни секунды пропущено
        }

        // Чистим очередь от null и сортируем её:
        var len = b.loaders.length;
        var i = 0;
        var j = 0;
        while (i < len) {
            if (b.loaders[i] == null) {
                i ++;
                continue;
            }

            b.loaders[j] = b.loaders[i];
            i ++;
            j ++;
        }
        if (i != j)
            b.loaders.resize(j);
        b.loaders.sort(compare);

        // Забираем из списка отправляемые элементы: (При отправке список может измениться!)
        var arr:Array<ILoader> = NativeJS.array(num);
        i = num;
        while (i-- > 0) {
            arr[i] = b.loaders[i];
            b.loaders[i] = null; // <-- Удалится на следующей иттерации
        }
        b.length -= num;

        // Безопасно инициируем запросы:
        while (num-- > 0) {
            if (arr[num].state == LoaderState.PENDING && arr[num].balancer == b)
                arr[num].loadStart();
        }
    }

    static private function compare(x:ILoader, y:ILoader):Int {
        if (x.priority > y.priority)
            return -1;
        if (x.priority < y.priority)
            return 1;
        
        return 0;
    }

    /**
     * Выполнить все запросы в очереди.  
     * Вызов этого метода приводит к мгновенной отправке всех запросов,
     * находящихся в данный момент в очереди.  
     * Очередь запросов очищается.
     */
    public function flush():Void {
        var i = 0;
        var arr = loaders;
        var len = arr.length;

        loaders = new Array(); // <-- Список может измениться из-за вызова колбеков
        time = NativeJS.now();
        length = 0;

        // Обновления не нужны:
        if (interval != null) {
            Global.clearInterval(interval);
            interval = null;
        }

        // Безопасно инициируем запросы:
        while (i < len) {
            var l = arr[i++];
            if (l != null && l.state == LoaderState.PENDING && l.balancer == this)
                l.loadStart();
        }
    }

    /**
     * Очистить балансировщик.
     * - У загрузчиков в очереди вызывается метод: `Loader.close()`. (Состояние: `LoaderState.PENDING`)
     * - Уже выполняемые и завершённые запросы - игнорируются.
     * - Очередь запросов очищается.
     */
    public function clear():Void {
        var i = 0;
        var arr = loaders;
        var len = arr.length;
        
        loaders = new Array(); // <-- Список может измениться из-за вызова колбеков
        length = 0;

        // Обновления не нужны:
        if (interval != null) {
            Global.clearInterval(interval);
            interval = null;
        }

        // Безопасно закрываем очередь:
        while (i < len) {
            var l = arr[i++];
            if (l == null || l.state != LoaderState.PENDING)
                continue;

            l.close();
        }
    }

    /**
     * Добавить загрузчик в очередь на отправку.  
     * Регистрирует переданный загрузчик в очереди и инициирует
     * в будущем его загрузку. Этот метод не выполняет никаких
     * проверок и просто добавляет переданный экземпляр в очередь.
     * - Этот метод должен вызываться только один раз, иначе будут
     *   дубли в очереди.
     * - Не забудьте удалить загрузчик из очереди, если его загрузку
     *   отменит пользователь вызовом метода: `Loader.close()`.
     * @param loader Загрузчик.
     */
    @:allow(loader.ILoader)
    private function add(loader:ILoader):Void {
        length ++;
        loaders.push(loader);
        
        if (interval == null && rps > 0)
            interval = Global.setInterval(onUpdate, INTERVAL_UPDATE, this);
    }

    /**
     * Удалить загрузчик из очереди на отправку.  
     * Удаляет из очереди первый найденный экземпляр.
     * Этот метод не выполняет никаких дополнительных действий.
     * @param loader Загрузчик.
     */
    @:allow(loader.ILoader)
    private function remove(loader:ILoader):Void {
        var i = 0;
        var len = loaders.length;
        while (i < len) {
            if (loaders[i] == loader) {
                length --;
                loaders[i] = null; // <-- Список перестроится при следующем обновлении.
                return;
            }

            i ++;
        }
    }
}